<?php

namespace Database\Seeders;
use Illuminate\Database\Seeder;


class PermissionsSeeder extends Seeder
{
    public function run(): void
    {
        app()[\Spatie\Permission\PermissionRegistrar::class]->forgetCachedPermissions();

        $permissions = [
            // لوحة التحكم
            ['name' => 'لوحة التحكم',                                      'group_name' => 'لوحة التحكم'],

            // المستخدمين
            ['name' => 'إدارة المستخدمين',                                 'group_name' => 'المستخدمين'],
            ['name' => 'إضافة مستخدم',                                     'group_name' => 'المستخدمين'],
            ['name' => 'تعديل مستخدم',                                     'group_name' => 'المستخدمين'],
            ['name' => 'حذف مستخدم',                                       'group_name' => 'المستخدمين'],

            // المسؤولين والصلاحيات
            ['name' => 'إدارة المسؤولين والصلاحيات',                       'group_name' => 'المسؤولين والصلاحيات'],
            ['name' => 'استعراض المسؤولين',                                'group_name' => 'المسؤولين والصلاحيات'],
            ['name' => 'اضافة مسؤول',                                      'group_name' => 'المسؤولين والصلاحيات'],
            ['name' => 'تعديل مسؤول',                                      'group_name' => 'المسؤولين والصلاحيات'],
            ['name' => 'حذف مسؤول',                                        'group_name' => 'المسؤولين والصلاحيات'],
            ['name' => 'استعراض الصلاحيات',                               'group_name' => 'المسؤولين والصلاحيات'],
            ['name' => 'اضافة صلاحية',                                     'group_name' => 'المسؤولين والصلاحيات'],
            ['name' => 'تعديل صلاحية',                                     'group_name' => 'المسؤولين والصلاحيات'],
            ['name' => 'حذف صلاحية',                                       'group_name' => 'المسؤولين والصلاحيات'],
            ['name' => 'استعراض صلاحيات المسؤولين',                       'group_name' => 'المسؤولين والصلاحيات'],
            ['name' => 'اضافة صلاحيات مسؤول',                             'group_name' => 'المسؤولين والصلاحيات'],
            ['name' => 'تعديل صلاحيات مسؤول',                             'group_name' => 'المسؤولين والصلاحيات'],
            ['name' => 'حذف مسؤول مع صلاحياته',                           'group_name' => 'المسؤولين والصلاحيات'],

            // الكفلاء
            ['name' => 'إدارة الكفلاء',                                    'group_name' => 'الكفلاء'],
            ['name' => 'إضافة كفيل',                                       'group_name' => 'الكفلاء'],
            ['name' => 'تعديل كفيل',                                       'group_name' => 'الكفلاء'],
            ['name' => 'حذف كفيل',                                         'group_name' => 'الكفلاء'],

            // الأقاليم والمدن
            ['name' => 'إدارة الأقاليم والمدن',                            'group_name' => 'الأقاليم والمدن'],
            ['name' => 'استعراض الأقاليم',                                 'group_name' => 'الأقاليم والمدن'],
            ['name' => 'إضافة إقليم',                                      'group_name' => 'الأقاليم والمدن'],
            ['name' => 'تعديل إقليم',                                      'group_name' => 'الأقاليم والمدن'],
            ['name' => 'حذف إقليم',                                        'group_name' => 'الأقاليم والمدن'],
            ['name' => 'استعراض المدن',                                    'group_name' => 'الأقاليم والمدن'],
            ['name' => 'إضافة مدينة',                                      'group_name' => 'الأقاليم والمدن'],
            ['name' => 'تعديل مدينة',                                      'group_name' => 'الأقاليم والمدن'],
            ['name' => 'حذف مدينة',                                        'group_name' => 'الأقاليم والمدن'],

            // الفئات المستفيدة
            ['name' => 'إدارة الفئات المستفيدة',                           'group_name' => 'الفئات المستفيدة'],
            ['name' => 'استعراض أسر الأيتام',                              'group_name' => 'الفئات المستفيدة'],
            ['name' => 'اضافة أسرة',                                       'group_name' => 'الفئات المستفيدة'],
            ['name' => 'اضافة يتيم',                                       'group_name' => 'الفئات المستفيدة'],
            ['name' => 'اضافة تقرير دورى لأسرة',                          'group_name' => 'الفئات المستفيدة'],
            ['name' => 'تعديل أسرة',                                       'group_name' => 'الفئات المستفيدة'],
            ['name' => 'حذف أسرة',                                         'group_name' => 'الفئات المستفيدة'],
            ['name' => 'استعراض الأسر فى وضعية صعبة',                     'group_name' => 'الفئات المستفيدة'],
            ['name' => 'اضافة أسرة فى وضعية صعبة',                        'group_name' => 'الفئات المستفيدة'],
            ['name' => 'تعديل أسرة فى وضعية صعبة',                        'group_name' => 'الفئات المستفيدة'],
            ['name' => 'حذف أسرة فى وضعية صعبة',                          'group_name' => 'الفئات المستفيدة'],
            ['name' => 'استعراض المرضى وذوي الإحتياجات الخاصة',           'group_name' => 'الفئات المستفيدة'],
            ['name' => 'اضافة حالة مرضى وذوي الإحتياجات الخاصة',         'group_name' => 'الفئات المستفيدة'],
            ['name' => 'تعديل حالة مرضى وذوي الإحتياجات الخاصة',         'group_name' => 'الفئات المستفيدة'],
            ['name' => 'حذف حالة مرضى وذوي الإحتياجات الخاصة',           'group_name' => 'الفئات المستفيدة'],

            // برامج الدعم
            ['name' => 'إدارة برامج الدعم',                                'group_name' => 'برامج الدعم'],
            ['name' => 'استعراض برامج الدعم',                              'group_name' => 'برامج الدعم'],
            ['name' => 'اضافة برنامج دعم',                                 'group_name' => 'برامج الدعم'],
            ['name' => 'تعديل برنامج دعم',                                 'group_name' => 'برامج الدعم'],
            ['name' => 'حذف برنامج دعم',                                   'group_name' => 'برامج الدعم'],
            ['name' => 'إضافة دعم الأسر فى وضعية صعبة',                   'group_name' => 'برامج الدعم'],
            ['name' => 'إضافة دعم المرضى وذوي الاحتياجات الخاصة',         'group_name' => 'برامج الدعم'],

            // الأيتام
            ['name' => 'إدارة الأيتام',                                    'group_name' => 'الأيتام'],
            ['name' => 'تعديل يتيم',                                       'group_name' => 'الأيتام'],
            ['name' => 'حذف يتيم',                                         'group_name' => 'الأيتام'],
            ['name' => 'إيقاف يتيم',                                       'group_name' => 'الأيتام'],
            ['name' => 'إنهاء كفالة يتيم',                                 'group_name' => 'الأيتام'],

            // كفالة الأيتام
            ['name' => 'إدارة كفالة الأيتام',                              'group_name' => 'كفالة الأيتام'],

            // التقارير
            ['name' => 'إدارة التقارير',                                   'group_name' => 'التقارير'],
            ['name' => 'تقرير أسر الأيتام',                                'group_name' => 'التقارير'],
            ['name' => 'تقرير الأسر في وضعية صعبة',                       'group_name' => 'التقارير'],
            ['name' => 'تقرير المرضى وذوي الاحتياجات',                    'group_name' => 'التقارير'],
            ['name' => 'تقرير دعم الأسر في وضعية صعبة',                   'group_name' => 'التقارير'],
            ['name' => 'تقرير دعم المرضى وذوي الاحتياجات',                'group_name' => 'التقارير'],

            // النسخ الإحتياطية
            ['name' => 'إدارة النسخ الإحتياطية',                          'group_name' => 'النسخ الإحتياطية'],
            ['name' => 'إضافة نسخة إحتياطية',                             'group_name' => 'النسخ الإحتياطية'],
            ['name' => 'تحميل نسخة إحتياطية',                             'group_name' => 'النسخ الإحتياطية'],
            ['name' => 'حذف نسخة إحتياطية',                               'group_name' => 'النسخ الإحتياطية'],
        ];

        foreach ($permissions as $permission) {
            Permission::firstOrCreate(
                ['name'       => $permission['name']],
                ['group_name' => $permission['group_name'], 'guard_name' => 'web']
            );
        }
    }
}